#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-725XiTMxbgb7oTmF

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.quarkus_jackson_jq: Refreshing state... [id=quarkus-jackson-jq]
github_repository.quarkus_hivemq_client: Refreshing state... [id=quarkus-hivemq-client]
github_repository.quarkus_github_api: Refreshing state... [id=quarkus-github-api]
github_repository.quarkus_hibernate_search_extras: Refreshing state... [id=quarkus-hibernate-search-extras]
github_repository.quarkus_logging_manager: Refreshing state... [id=quarkus-logging-manager]
github_repository.quarkus_jjwt_jackson: Refreshing state... [id=quarkus-jjwt-jackson]
github_repository.quarkus_logging_json: Refreshing state... [id=quarkus-logging-json]
github_repository.quarkus_rabbitmq_client: Refreshing state... [id=quarkus-rabbitmq-client]
github_repository.quarkus_lucene: Refreshing state... [id=quarkus-lucene]
github_repository.quarkus_micrometer_registry: Refreshing state... [id=quarkus-micrometer-registry]
github_repository.quarkus_amazon_services: Refreshing state... [id=quarkus-amazon-services]
github_repository.quarkus_xmlsec: Refreshing state... [id=quarkus-xmlsec]
github_repository.quarkus_microprofile: Refreshing state... [id=quarkus-microprofile]
github_repository.quarkus_github_app: Refreshing state... [id=quarkus-github-app]
github_repository.quarkus_mybatis: Refreshing state... [id=quarkus-mybatis]
github_repository.quarkus_zeebe: Refreshing state... [id=quarkus-zeebe]
github_repository.quarkus_opencv: Refreshing state... [id=quarkus-opencv]
github_repository.quarkus_reactive_messaging_http: Refreshing state... [id=quarkus-reactive-messaging-http]
github_repository.quarkus_doma: Refreshing state... [id=quarkus-doma]
github_repository.quarkus_kerberos: Refreshing state... [id=quarkus-kerberos]
github_repository.quarkus_mockk: Refreshing state... [id=quarkus-mockk]
github_repository.quarkus_vault: Refreshing state... [id=quarkus-vault]
github_repository.quarkus_jgrapht: Refreshing state... [id=quarkus-jgrapht]
github_repository.quarkus_logging_cloudwatch: Refreshing state... [id=quarkus-logging-cloudwatch]
github_repository.quarkus_neo4j: Refreshing state... [id=quarkus-neo4j]
github_repository.quarkus_jooq: Refreshing state... [id=quarkus-jooq]
github_repository.quarkus_google_cloud_services: Refreshing state... [id=quarkus-google-cloud-services]
github_repository.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_repository.quarkus_renarde: Refreshing state... [id=quarkus-renarde]
github_repository.quarkus_logging_splunk: Refreshing state... [id=quarkus-logging-splunk]
github_repository.quarkus_rsocket: Refreshing state... [id=quarkus-rsocket]
github_repository.quarkus_maven_resolver: Refreshing state... [id=quarkus-maven-resolver]
github_repository.quarkus_qson: Refreshing state... [id=quarkus-qson]
github_repository.quarkus_freemarker: Refreshing state... [id=quarkus-freemarker]
github_repository.quarkus_tika: Refreshing state... [id=quarkus-tika]
github_repository.quarkus_logging_sentry: Refreshing state... [id=quarkus-logging-sentry]
github_repository.quarkus_scala: Refreshing state... [id=quarkus-scala3]
github_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_repository.quarkus_tekton_client: Refreshing state... [id=quarkus-tekton-client]
github_repository.quarkus_openapi_generator: Refreshing state... [id=quarkus-openapi-generator]
github_repository.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_repository.quarkus_univocity_parsers: Refreshing state... [id=quarkus-univocity-parsers]
github_repository.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_repository.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=quarkus-shardingsphere-jdbc]
github_repository.quarkus_unleash: Refreshing state... [id=quarkus-unleash]
github_repository.quarkus_operator_sdk: Refreshing state... [id=quarkus-operator-sdk]
github_repository.quarkus_morphia: Refreshing state... [id=quarkus-morphia]
github_repository.quarkus_artemis: Refreshing state... [id=quarkus-artemis]
github_repository.quarkus_jsch: Refreshing state... [id=quarkus-jsch]
github_repository.quarkus_pusher_beams: Refreshing state... [id=quarkus-pusher-beams]
github_repository.quarkus_jna: Refreshing state... [id=quarkus-jna]
github_repository.quarkus_minio: Refreshing state... [id=quarkus-minio]
github_repository.quarkus_amazon_alexa: Refreshing state... [id=quarkus-amazon-alexa]
github_repository.quarkus_jberet: Refreshing state... [id=quarkus-jberet]
github_repository.quarkus_hibernate_types: Refreshing state... [id=quarkus-hibernate-types]
github_repository.quarkus_datadog_opentracing: Refreshing state... [id=quarkus-datadog-opentracing]
github_repository.quarkus_prettytime: Refreshing state... [id=quarkus-prettytime]
github_repository.quarkus_jgit: Refreshing state... [id=quarkus-jgit]
github_repository.quarkus_helm: Refreshing state... [id=quarkus-helm]
github_repository.quarkus_logging_logback: Refreshing state... [id=quarkus-logging-logback]
github_app_installation_repository.quarkus_rabbitmq_client["20894091"]: Refreshing state... [id=20894091:quarkus-rabbitmq-client]
github_repository_collaborator.quarkus_github_app["yrodiere"]: Refreshing state... [id=quarkus-github-app:yrodiere]
github_repository_collaborator.quarkus_google_cloud_services["dzou"]: Refreshing state... [id=quarkus-google-cloud-services:dzou]
github_branch.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client:master]
github_branch.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive:main]
github_branch.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions:main]
github_branch.quarkus_cxf: Refreshing state... [id=quarkus-cxf:master]
github_branch.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber:main]
github_branch.quarkus_jsch: Refreshing state... [id=quarkus-jsch:main]
github_repository_collaborator.quarkus_jberet["aureamunoz"]: Refreshing state... [id=quarkus-jberet:aureamunoz]
github_team.quarkus_config_extensions: Refreshing state... [id=4679791]
github_team.quarkus_jackson_jq: Refreshing state... [id=5182252]
github_team.quarkus_neo4j: Refreshing state... [id=5438745]
github_team.quarkus_cucumber: Refreshing state... [id=5020733]
github_team.quarkus_google_cloud_services: Refreshing state... [id=4133757]
github_team.quarkus_operator_sdk: Refreshing state... [id=4585468]
github_team.quarkus_lucene: Refreshing state... [id=4572442]
github_team.quarkus_logging_cloudwatch: Refreshing state... [id=4766806]
github_team.quarkus_helm: Refreshing state... [id=5693931]
github_team.quarkus_tekton_client: Refreshing state... [id=4429729]
github_team.quarkus_amazon_alexa: Refreshing state... [id=5438751]
github_team.quarkus_artemis: Refreshing state... [id=5438742]
github_team.quarkus_vault: Refreshing state... [id=5438750]
github_team.quarkus_github_app: Refreshing state... [id=5327479]
github_team.quarkus_scala: Refreshing state... [id=4973599]
github_team.quarkus_logging_splunk: Refreshing state... [id=4611522]
github_team.quarkus_jna: Refreshing state... [id=4257639]
github_team.quarkus_apicurio_registry_client: Refreshing state... [id=4359832]
github_team.quarkus_xmlsec: Refreshing state... [id=5249540]
github_team.quarkus_qson: Refreshing state... [id=5258394]
github_team.quarkus_univocity_parsers: Refreshing state... [id=4707008]
github_team.quarkus_morphia: Refreshing state... [id=4994632]
github_team.quarkus_tika: Refreshing state... [id=5317008]
github_team.quarkus_prettytime: Refreshing state... [id=4612233]
github_team.quarkus_doma: Refreshing state... [id=4206574]
github_team.quarkus_logging_json: Refreshing state... [id=4136031]
github_team.quarkus_jgit: Refreshing state... [id=5418782]
github_team.quarkus_renarde: Refreshing state... [id=5464969]
github_team.quarkus_reactive_messaging_http: Refreshing state... [id=5290863]
github_team.quarkus_logging_sentry: Refreshing state... [id=5300000]
github_team.quarkus_microprofile: Refreshing state... [id=5018652]
github_team.quarkus_maven_resolver: Refreshing state... [id=5330694]
github_team.quarkus_cxf: Refreshing state... [id=4221025]
github_team.quarkus_jooq: Refreshing state... [id=4499064]
github_team.quarkus_amazon_services: Refreshing state... [id=5438747]
github_team.quarkus_openapi_generator: Refreshing state... [id=5649834]
github_team.quarkus_hibernate_types: Refreshing state... [id=4427586]
github_team.quarkus_unleash: Refreshing state... [id=4478763]
github_team.quarkus_jberet: Refreshing state... [id=4130738]
github_team.quarkus_logging_manager: Refreshing state... [id=4193789]
github_team.quarkus_hivemq_client: Refreshing state... [id=4651319]
github_team.quarkus_github_api: Refreshing state... [id=5327486]
github_team.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463]
github_team.quarkus_mybatis: Refreshing state... [id=4163389]
github_team.quarkus_logging_logback: Refreshing state... [id=4934360]
github_team.quarkus_freemarker: Refreshing state... [id=4139356]
github_team.quarkus_jjwt_jackson: Refreshing state... [id=4698127]
github_team.quarkus_rsocket: Refreshing state... [id=4628116]
github_team.quarkus_minio: Refreshing state... [id=4257600]
github_team.quarkus_opencv: Refreshing state... [id=5330519]
github_team.quarkus_mockk: Refreshing state... [id=4479092]
github_team.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628]
github_team.quarkus_hibernate_search_extras: Refreshing state... [id=5449102]
github_team.quarkus_jsch: Refreshing state... [id=5418783]
github_team.quarkus_kerberos: Refreshing state... [id=5330599]
github_team.quarkus_micrometer_registry: Refreshing state... [id=4331393]
github_team.quarkus_datadog_opentracing: Refreshing state... [id=4759562]
github_team.quarkus_pusher_beams: Refreshing state... [id=5502715]
github_team.quarkus_zeebe: Refreshing state... [id=5333665]
github_team.quarkus_rabbitmq_client: Refreshing state... [id=4454281]
github_team.quarkus_jgrapht: Refreshing state... [id=4691584]
github_branch_default.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_branch_default.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_branch_default.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_branch.quarkus_jgit: Refreshing state... [id=quarkus-jgit:main]
github_branch_default.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_branch_default.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_branch_default.quarkus_jsch: Refreshing state... [id=quarkus-jsch]
github_team_membership.quarkus_config_extensions["radcortez"]: Refreshing state... [id=4679791:radcortez]
github_team_repository.quarkus_config_extensions: Refreshing state... [id=4679791:quarkus-config-extensions]
github_team_repository.quarkus_jackson_jq: Refreshing state... [id=5182252:quarkus-jackson-jq]
github_team_repository.quarkus_neo4j: Refreshing state... [id=5438745:quarkus-neo4j]
github_team_membership.quarkus_jackson_jq["aloubyansky"]: Refreshing state... [id=5182252:aloubyansky]
github_team_membership.quarkus_jackson_jq["ricardozanini"]: Refreshing state... [id=5182252:ricardozanini]
github_team_membership.quarkus_neo4j["michael-simons"]: Refreshing state... [id=5438745:michael-simons]
github_team_membership.quarkus_cucumber["christophd"]: Refreshing state... [id=5020733:christophd]
github_team_membership.quarkus_cucumber["stuartwdouglas"]: Refreshing state... [id=5020733:stuartwdouglas]
github_team_repository.quarkus_cucumber: Refreshing state... [id=5020733:quarkus-cucumber]
github_team_repository.quarkus_google_cloud_services: Refreshing state... [id=4133757:quarkus-google-cloud-services]
github_team_membership.quarkus_google_cloud_services["loicmathieu"]: Refreshing state... [id=4133757:loicmathieu]
github_team_membership.quarkus_operator_sdk["metacosm"]: Refreshing state... [id=4585468:metacosm]
github_team_repository.quarkus_operator_sdk: Refreshing state... [id=4585468:quarkus-operator-sdk]
github_team_membership.quarkus_lucene["gustavocoding"]: Refreshing state... [id=4572442:gustavocoding]
github_team_repository.quarkus_lucene: Refreshing state... [id=4572442:quarkus-lucene]
github_team_membership.quarkus_logging_cloudwatch["bennetelli"]: Refreshing state... [id=4766806:bennetelli]
github_team_repository.quarkus_logging_cloudwatch: Refreshing state... [id=4766806:quarkus-logging-cloudwatch]
github_team_membership.quarkus_logging_cloudwatch["pilhuhn"]: Refreshing state... [id=4766806:pilhuhn]
github_team_repository.quarkus_helm: Refreshing state... [id=5693931:quarkus-helm]
github_team_membership.quarkus_helm["Sgitario"]: Refreshing state... [id=5693931:Sgitario]
github_team_repository.quarkus_tekton_client: Refreshing state... [id=4429729:quarkus-tekton-client]
github_team_membership.quarkus_tekton_client["goldmann"]: Refreshing state... [id=4429729:goldmann]
github_team_repository.quarkus_amazon_alexa: Refreshing state... [id=5438751:quarkus-amazon-alexa]
github_team_membership.quarkus_amazon_alexa["oztimpower"]: Refreshing state... [id=5438751:oztimpower]
github_team_membership.quarkus_artemis["middagj"]: Refreshing state... [id=5438742:middagj]
github_team_repository.quarkus_artemis: Refreshing state... [id=5438742:quarkus-artemis]
github_team_repository.quarkus_vault: Refreshing state... [id=5438750:quarkus-vault]
github_team_membership.quarkus_github_app["gsmet"]: Refreshing state... [id=5327479:gsmet]
github_team_membership.quarkus_vault["kdubb"]: Refreshing state... [id=5438750:kdubb]
github_team_membership.quarkus_vault["vsevel"]: Refreshing state... [id=5438750:vsevel]
github_team_membership.quarkus_vault["sberyozkin"]: Refreshing state... [id=5438750:sberyozkin]
github_team_repository.quarkus_github_app: Refreshing state... [id=5327479:quarkus-github-app]
github_team_repository.quarkus_scala: Refreshing state... [id=4973599:quarkus-scala3]
github_team_membership.quarkus_scala["GavinRay97"]: Refreshing state... [id=4973599:GavinRay97]
github_team_membership.quarkus_logging_splunk["rquinio1A"]: Refreshing state... [id=4611522:rquinio1A]
github_team_membership.quarkus_logging_splunk["vietk"]: Refreshing state... [id=4611522:vietk]
github_team_repository.quarkus_logging_splunk: Refreshing state... [id=4611522:quarkus-logging-splunk]
github_team_repository.quarkus_jna: Refreshing state... [id=4257639:quarkus-jna]
github_team_membership.quarkus_jna["dufoli"]: Refreshing state... [id=4257639:dufoli]
github_team_membership.quarkus_apicurio_registry_client["famarting"]: Refreshing state... [id=4359832:famarting]
github_team_repository.quarkus_apicurio_registry_client: Refreshing state... [id=4359832:quarkus-apicurio-registry-client]
github_team_repository.quarkus_xmlsec: Refreshing state... [id=5249540:quarkus-xmlsec]
github_team_membership.quarkus_xmlsec["martinffx"]: Refreshing state... [id=5249540:martinffx]
github_team_membership.quarkus_xmlsec["gastaldi"]: Refreshing state... [id=5249540:gastaldi]
github_team_membership.quarkus_qson["patriot1burke"]: Refreshing state... [id=5258394:patriot1burke]
github_team_repository.quarkus_qson: Refreshing state... [id=5258394:quarkus-qson]
github_team_membership.quarkus_univocity_parsers["aruffie"]: Refreshing state... [id=4707008:aruffie]
github_team_repository.quarkus_univocity_parsers: Refreshing state... [id=4707008:quarkus-univocity-parsers]
github_team_membership.quarkus_morphia["evanchooly"]: Refreshing state... [id=4994632:evanchooly]
github_team_repository.quarkus_morphia: Refreshing state... [id=4994632:quarkus-morphia]
github_team_repository.quarkus_tika: Refreshing state... [id=5317008:quarkus-tika]
github_team_membership.quarkus_tika["sberyozkin"]: Refreshing state... [id=5317008:sberyozkin]
github_team_repository.quarkus_prettytime: Refreshing state... [id=4612233:quarkus-prettytime]
github_team_membership.quarkus_prettytime["gastaldi"]: Refreshing state... [id=4612233:gastaldi]
github_team_membership.quarkus_doma["nakamura-to"]: Refreshing state... [id=4206574:nakamura-to]
github_team_repository.quarkus_doma: Refreshing state... [id=4206574:quarkus-doma]
github_team_membership.quarkus_logging_json["SlyngDK"]: Refreshing state... [id=4136031:SlyngDK]
github_team_repository.quarkus_logging_json: Refreshing state... [id=4136031:quarkus-logging-json]
github_team_repository.quarkus_jgit: Refreshing state... [id=5418782:quarkus-jgit]
github_team_membership.quarkus_jgit["gastaldi"]: Refreshing state... [id=5418782:gastaldi]
github_team_membership.quarkus_renarde["FroMage"]: Refreshing state... [id=5464969:FroMage]
github_team_repository.quarkus_renarde: Refreshing state... [id=5464969:quarkus-renarde]
github_team_membership.quarkus_reactive_messaging_http["michalszynkiewicz"]: Refreshing state... [id=5290863:michalszynkiewicz]
github_team_repository.quarkus_reactive_messaging_http: Refreshing state... [id=5290863:quarkus-reactive-messaging-http]
github_team_membership.quarkus_logging_sentry["gsmet"]: Refreshing state... [id=5300000:gsmet]
github_team_repository.quarkus_logging_sentry: Refreshing state... [id=5300000:quarkus-logging-sentry]
github_team_membership.quarkus_logging_sentry["ia3andy"]: Refreshing state... [id=5300000:ia3andy]
github_team_membership.quarkus_microprofile["radcortez"]: Refreshing state... [id=5018652:radcortez]
github_team_repository.quarkus_microprofile: Refreshing state... [id=5018652:quarkus-microprofile]
github_team_membership.quarkus_maven_resolver["aloubyansky"]: Refreshing state... [id=5330694:aloubyansky]
github_team_membership.quarkus_maven_resolver["gastaldi"]: Refreshing state... [id=5330694:gastaldi]
github_team_repository.quarkus_maven_resolver: Refreshing state... [id=5330694:quarkus-maven-resolver]
github_team_repository.quarkus_cxf: Refreshing state... [id=4221025:quarkus-cxf]
github_team_membership.quarkus_cxf["Dufgui"]: Refreshing state... [id=4221025:Dufgui]
github_team_membership.quarkus_cxf["dufoli"]: Refreshing state... [id=4221025:dufoli]
github_team_membership.quarkus_cxf["shumonsharif"]: Refreshing state... [id=4221025:shumonsharif]
github_team_repository.quarkus_jooq: Refreshing state... [id=4499064:quarkus-jooq]
github_team_membership.quarkus_jooq["angrymango"]: Refreshing state... [id=4499064:angrymango]
github_team_repository.quarkus_amazon_services: Refreshing state... [id=5438747:quarkus-amazon-services]
github_team_membership.quarkus_amazon_services["marcinczeczko"]: Refreshing state... [id=5438747:marcinczeczko]
github_team_repository.quarkus_openapi_generator: Refreshing state... [id=5649834:quarkus-openapi-generator]
github_team_membership.quarkus_openapi_generator["ricardozanini"]: Refreshing state... [id=5649834:ricardozanini]
github_team_repository.quarkus_hibernate_types: Refreshing state... [id=4427586:quarkus-hibernate-types]
github_team_membership.quarkus_hibernate_types["andrejpetras"]: Refreshing state... [id=4427586:andrejpetras]
github_team_repository.quarkus_unleash: Refreshing state... [id=4478763:quarkus-unleash]
github_team_membership.quarkus_unleash["andrejpetras"]: Refreshing state... [id=4478763:andrejpetras]
github_team_membership.quarkus_jberet["radcortez"]: Refreshing state... [id=4130738:radcortez]
github_team_repository.quarkus_jberet: Refreshing state... [id=4130738:quarkus-jberet]
github_team_membership.quarkus_logging_manager["oscarfh"]: Refreshing state... [id=4193789:oscarfh]
github_team_membership.quarkus_logging_manager["phillip-kruger"]: Refreshing state... [id=4193789:phillip-kruger]
github_team_repository.quarkus_logging_manager: Refreshing state... [id=4193789:quarkus-logging-manager]
github_team_membership.quarkus_hivemq_client["masini"]: Refreshing state... [id=4651319:masini]
github_team_repository.quarkus_hivemq_client: Refreshing state... [id=4651319:quarkus-hivemq-client]
github_team_membership.quarkus_github_api["gsmet"]: Refreshing state... [id=5327486:gsmet]
github_team_repository.quarkus_github_api: Refreshing state... [id=5327486:quarkus-github-api]
github_team_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463:quarkus-elasticsearch-reactive]
github_team_membership.quarkus_elasticsearch_reactive["loicmathieu"]: Refreshing state... [id=4941463:loicmathieu]
github_team_repository.quarkus_mybatis: Refreshing state... [id=4163389:quarkus-mybatis]
github_team_membership.quarkus_mybatis["zhfeng"]: Refreshing state... [id=4163389:zhfeng]
github_team_membership.quarkus_mybatis["zohar-soul"]: Refreshing state... [id=4163389:zohar-soul]
github_team_membership.quarkus_logging_logback["stuartwdouglas"]: Refreshing state... [id=4934360:stuartwdouglas]
github_team_repository.quarkus_logging_logback: Refreshing state... [id=4934360:quarkus-logging-logback]
github_team_repository.quarkus_freemarker: Refreshing state... [id=4139356:quarkus-freemarker]
github_team_membership.quarkus_freemarker["vsevel"]: Refreshing state... [id=4139356:vsevel]
github_team_repository.quarkus_jjwt_jackson: Refreshing state... [id=4698127:quarkus-jjwt-jackson]
github_team_membership.quarkus_jjwt_jackson["gsmet"]: Refreshing state... [id=4698127:gsmet]
github_team_membership.quarkus_rsocket["dufoli"]: Refreshing state... [id=4628116:dufoli]
github_team_repository.quarkus_rsocket: Refreshing state... [id=4628116:quarkus-rsocket]
github_team_repository.quarkus_minio: Refreshing state... [id=4257600:quarkus-minio]
github_team_membership.quarkus_minio["jtama"]: Refreshing state... [id=4257600:jtama]
github_team_membership.quarkus_opencv["gsmet"]: Refreshing state... [id=5330519:gsmet]
github_team_repository.quarkus_opencv: Refreshing state... [id=5330519:quarkus-opencv]
github_team_repository.quarkus_mockk: Refreshing state... [id=4479092:quarkus-mockk]
github_team_membership.quarkus_mockk["glefloch"]: Refreshing state... [id=4479092:glefloch]
github_team_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628:quarkus-shardingsphere-jdbc]
github_team_membership.quarkus_shardingsphere_jdbc["zhfeng"]: Refreshing state... [id=5330628:zhfeng]
github_team_repository.quarkus_hibernate_search_extras: Refreshing state... [id=5449102:quarkus-hibernate-search-extras]
github_team_repository.quarkus_jsch: Refreshing state... [id=5418783:quarkus-jsch]
github_team_membership.quarkus_hibernate_search_extras["yrodiere"]: Refreshing state... [id=5449102:yrodiere]
github_team_membership.quarkus_jsch["gastaldi"]: Refreshing state... [id=5418783:gastaldi]
github_team_repository.quarkus_kerberos: Refreshing state... [id=5330599:quarkus-kerberos]
github_team_membership.quarkus_kerberos["cescoffier"]: Refreshing state... [id=5330599:cescoffier]
github_team_membership.quarkus_kerberos["sberyozkin"]: Refreshing state... [id=5330599:sberyozkin]
github_team_membership.quarkus_kerberos["stuartwdouglas"]: Refreshing state... [id=5330599:stuartwdouglas]
github_team_repository.quarkus_micrometer_registry: Refreshing state... [id=4331393:quarkus-micrometer-registry]
github_team_membership.quarkus_micrometer_registry["jonatan-ivanov"]: Refreshing state... [id=4331393:jonatan-ivanov]
github_team_membership.quarkus_micrometer_registry["kenfinnigan"]: Refreshing state... [id=4331393:kenfinnigan]
github_team_membership.quarkus_micrometer_registry["ebullient"]: Refreshing state... [id=4331393:ebullient]
github_team_repository.quarkus_datadog_opentracing: Refreshing state... [id=4759562:quarkus-datadog-opentracing]
github_team_membership.quarkus_datadog_opentracing["nicolas-vivot"]: Refreshing state... [id=4759562:nicolas-vivot]
github_team_repository.quarkus_pusher_beams: Refreshing state... [id=5502715:quarkus-pusher-beams]
github_team_membership.quarkus_pusher_beams["nicolas-vivot"]: Refreshing state... [id=5502715:nicolas-vivot]
github_team_repository.quarkus_zeebe: Refreshing state... [id=5333665:quarkus-zeebe]
github_team_membership.quarkus_zeebe["andrejpetras"]: Refreshing state... [id=5333665:andrejpetras]
github_team_repository.quarkus_rabbitmq_client: Refreshing state... [id=4454281:quarkus-rabbitmq-client]
github_team_membership.quarkus_rabbitmq_client["bpasson"]: Refreshing state... [id=4454281:bpasson]
github_team_membership.quarkus_jgrapht["rsvoboda"]: Refreshing state... [id=4691584:rsvoboda]
github_team_repository.quarkus_jgrapht: Refreshing state... [id=4691584:quarkus-jgrapht]
github_branch_default.quarkus_jgit: Refreshing state... [id=quarkus-jgit]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.quarkus_amazon_alexa has changed
  ~ resource "github_repository" "quarkus_amazon_alexa" {
      ~ etag                   = "W/\"ec18520a96919a18db8bb37560234d6139a49efc1ab7bf8e71abdf01cbe47a43\"" -> "W/\"02d3bf79e8fedd52a58e986919dd610aeea60969f40b00d3902ca2ccc3e4d1f9\""
        id                     = "quarkus-amazon-alexa"
        name                   = "quarkus-amazon-alexa"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_amazon_services has changed
  ~ resource "github_repository" "quarkus_amazon_services" {
      ~ branches               = [
          ~ {
              ~ name      = "dependabot/maven/software.amazon.awssdk-bom-2.17.133" -> "dependabot/maven/software.amazon.awssdk-bom-2.17.134"
                # (1 unchanged element hidden)
            },
            {
                name      = "main"
                protected = false
            },
            # (1 unchanged element hidden)
        ]
      ~ etag                   = "W/\"02a624b3e9fdf09eda179e6ad5c176eb9eebf973b1b358d798e5dfb37df5b45b\"" -> "W/\"60002a482facd50cfd7a8ce033014a6726cd442e5e4862aa1243c0dd22cd0cfc\""
        id                     = "quarkus-amazon-services"
        name                   = "quarkus-amazon-services"
        # (25 unchanged attributes hidden)
    }

  # github_repository.quarkus_apicurio_registry_client has changed
  ~ resource "github_repository" "quarkus_apicurio_registry_client" {
      ~ etag                   = "W/\"3d8ecc1861d5049e2b5fbaeefa7ad75aee6408b35f39aced9244aa8a0b86689b\"" -> "W/\"e0e17f9297fda8bd5eab90eed4b2758b9f5b7357662e43b06ff87da6041a94ea\""
        id                     = "quarkus-apicurio-registry-client"
        name                   = "quarkus-apicurio-registry-client"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_artemis has changed
  ~ resource "github_repository" "quarkus_artemis" {
      ~ etag                   = "W/\"f82a87a93d51cd1c9e75ebc45c1a3f63ff36f6f9dbe8cd371a350efd9cc919e7\"" -> "W/\"0b371f0abb4f8438bc211633a35f15259011d502fb518365ddc3a5c74a0de95a\""
        id                     = "quarkus-artemis"
        name                   = "quarkus-artemis"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_config_extensions has changed
  ~ resource "github_repository" "quarkus_config_extensions" {
      ~ etag                   = "W/\"38b9899ad79feb673e38f6970f9a21970bbc84cc8ef42665d6601237aab743f2\"" -> "W/\"d64c970daa98325d03118dd8329f2c9a143473cbc6806beadef1128854863699\""
        id                     = "quarkus-config-extensions"
        name                   = "quarkus-config-extensions"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_cucumber has changed
  ~ resource "github_repository" "quarkus_cucumber" {
      ~ etag                   = "W/\"0b428f874a23b9c0814cff299fc5793817315ebbee4521af97f1203fe37d07ee\"" -> "W/\"a0ee9ac4ca29f477e88bae169e7254009d375ee4cfe281860148f97f6caff8ef\""
        id                     = "quarkus-cucumber"
        name                   = "quarkus-cucumber"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_cxf has changed
  ~ resource "github_repository" "quarkus_cxf" {
      ~ etag                   = "W/\"653c27514cc708bf65ee07ae709adb437f340d9d4a0e4a0243d8c8d3ed7a47c1\"" -> "W/\"18b3de7a317f3ea67b4bd75420aae03cd559e487b6766d87583edbef1f7039b3\""
        id                     = "quarkus-cxf"
        name                   = "quarkus-cxf"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_datadog_opentracing has changed
  ~ resource "github_repository" "quarkus_datadog_opentracing" {
      ~ etag                   = "W/\"e34f422a555872e83bff927f51566463b4e6befb9c5773fcd7cb45d7481ef91f\"" -> "W/\"e5c3226d1ccb7bbeb49dd3b62732e2c3b1d299d8d63d8115807f58402cd44b06\""
        id                     = "quarkus-datadog-opentracing"
        name                   = "quarkus-datadog-opentracing"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_doma has changed
  ~ resource "github_repository" "quarkus_doma" {
      ~ etag                   = "W/\"c79a0979c5adedb8005f795780705dba9d914ec3f46368b2b132775cf19a9960\"" -> "W/\"b17235bc7f11f368d638415b6ee7d45339b47ecd19174cc22f695aeda3b7029b\""
        id                     = "quarkus-doma"
        name                   = "quarkus-doma"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_elasticsearch_reactive has changed
  ~ resource "github_repository" "quarkus_elasticsearch_reactive" {
      ~ etag                   = "W/\"8c3d48aba001d8637fd0aa48305a0977dea3e6ba3ed2cb2046e14650aba5d80b\"" -> "W/\"ae1dd267f39924e4aae97262f51eeb7be27fb063fc86afa26a8cc92cd31989fc\""
        id                     = "quarkus-elasticsearch-reactive"
        name                   = "quarkus-elasticsearch-reactive"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_freemarker has changed
  ~ resource "github_repository" "quarkus_freemarker" {
      ~ etag                   = "W/\"67dd433080ec314307fe164fe6296205e8e37f8cdbf36f227af0267d2c2b824e\"" -> "W/\"bd605997e3fc91c523e4f9431648625f0be0eb8dc7f2e00cf3c70f889d608ce0\""
        id                     = "quarkus-freemarker"
        name                   = "quarkus-freemarker"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_github_api has changed
  ~ resource "github_repository" "quarkus_github_api" {
      ~ etag                   = "W/\"5a9d99d660b3f10ced53a0d96249e9b24b50ef281489496cd70f471660de876c\"" -> "W/\"8a1852b4ba1078c907520e7e0a08f53182830a1e74a61d84b298b3fabdd9c131\""
        id                     = "quarkus-github-api"
        name                   = "quarkus-github-api"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_github_app has changed
  ~ resource "github_repository" "quarkus_github_app" {
      ~ etag                   = "W/\"6eacb699010f7f58d98e029f23c6fb872c3c4547727a94d96319cf91c077d8fe\"" -> "W/\"f57de594c4e621a84eca7a60a1e4d0c829d7420e689ab131e76974fd9291bf97\""
        id                     = "quarkus-github-app"
        name                   = "quarkus-github-app"
        # (28 unchanged attributes hidden)
    }

  # github_repository.quarkus_google_cloud_services has changed
  ~ resource "github_repository" "quarkus_google_cloud_services" {
      ~ etag                   = "W/\"3b1780157670fdc6abc917d0f7c956b452313c83535d3721056a9520c7e90ceb\"" -> "W/\"897af7dc942857768c2c70de4a19a3ca0474376ef2bd2007e23a94a62b026bec\""
        id                     = "quarkus-google-cloud-services"
        name                   = "quarkus-google-cloud-services"
        # (28 unchanged attributes hidden)
    }

  # github_repository.quarkus_helm has changed
  ~ resource "github_repository" "quarkus_helm" {
      ~ branches               = [
          + {
              + name      = "main"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"185445d935ef13ccf57a60818fd963399cfdb290d774fa2e44919533d75f8b93\"" -> "W/\"8638e49af6d1f604e88a704831c7f666b4e3fe09881237c0944c74864488adec\""
        id                     = "quarkus-helm"
        name                   = "quarkus-helm"
        # (25 unchanged attributes hidden)
    }

  # github_repository.quarkus_hibernate_search_extras has changed
  ~ resource "github_repository" "quarkus_hibernate_search_extras" {
      ~ etag                   = "W/\"728380b75aa0f5f6de61ff388030beb7e629a19774611c6e6f6a8ad38850389e\"" -> "W/\"ab7ce414519567f21e8a8bdbdb470e365bec98dc2b898c8dbf94015857bf52fe\""
        id                     = "quarkus-hibernate-search-extras"
        name                   = "quarkus-hibernate-search-extras"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_hibernate_types has changed
  ~ resource "github_repository" "quarkus_hibernate_types" {
      ~ etag                   = "W/\"d573cf577b054f2174e415a545a5d5ca3615af1ef5621cbb2c5f3ebed80bd5e1\"" -> "W/\"14e3f8f4d8402f667cbc66243e8e912c8b00fbba4bf725e5aa4daf2138c9644b\""
        id                     = "quarkus-hibernate-types"
        name                   = "quarkus-hibernate-types"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_jackson_jq has changed
  ~ resource "github_repository" "quarkus_jackson_jq" {
      ~ etag                   = "W/\"ff9c669839c11716c67e94cadc55537e8372d96af176380c22d48f0fd4227838\"" -> "W/\"aa5981c642d8b50bc209020522199e0c77fbd1615c1923e2752416cec1b76150\""
        id                     = "quarkus-jackson-jq"
        name                   = "quarkus-jackson-jq"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_jberet has changed
  ~ resource "github_repository" "quarkus_jberet" {
      ~ etag                   = "W/\"fb702609a7543b0d49850814dfae554422e07206921698cc4a71387ff30e4b81\"" -> "W/\"7efcb5236ccb90651c796088684f376d2f35b5b89684bafbc069b78df0d6e0be\""
        id                     = "quarkus-jberet"
        name                   = "quarkus-jberet"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_jgit has changed
  ~ resource "github_repository" "quarkus_jgit" {
      ~ etag                   = "W/\"7a61505c22e9e555d98404d6f5628634c6762d3e69c506f00af1f82b4795f919\"" -> "W/\"5aeac16e59485b40858a759fddc24b7e978ee432f7d53abbb95644b7f3662d91\""
        id                     = "quarkus-jgit"
        name                   = "quarkus-jgit"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_jgrapht has changed
  ~ resource "github_repository" "quarkus_jgrapht" {
      ~ etag                   = "W/\"bd7ef0d71bfdb5b508a9d4e6cf8836049251c3d248e2dc268f1633d94e8d3514\"" -> "W/\"37b2d13f68e0fa60a6c6ee4a53fd13e474b78c63c6b51dc0765b8b794b610987\""
        id                     = "quarkus-jgrapht"
        name                   = "quarkus-jgrapht"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_jjwt_jackson has changed
  ~ resource "github_repository" "quarkus_jjwt_jackson" {
      ~ etag                   = "W/\"d40d4bc0d7574b225c405d5f7449d93c6b3983ac9ddd4ea411ad86a290adc99d\"" -> "W/\"54b69d647dfddd8d668e93ba366e7a6cf9bc8926a1d69d72b137d27b40010940\""
        id                     = "quarkus-jjwt-jackson"
        name                   = "quarkus-jjwt-jackson"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_jsch has changed
  ~ resource "github_repository" "quarkus_jsch" {
      ~ etag                   = "W/\"acf67003dedfb251774607c6e86cfeb61cc731ff3f0114580eca8432217cf65a\"" -> "W/\"2d6629559f3c7286b29d5522874fb38a733bec1649f8f7e7c90c01baba8f5f5d\""
        id                     = "quarkus-jsch"
        name                   = "quarkus-jsch"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_kerberos has changed
  ~ resource "github_repository" "quarkus_kerberos" {
      ~ etag                   = "W/\"0f0e8705ad55bb75fd2b56a80c51f806f82c322570ed4381caa56fd267b2803d\"" -> "W/\"c43211d6633616daa6cfd7b7fd9ee0a3ca32e4b1a427cc9a97f02fb65d16a86c\""
        id                     = "quarkus-kerberos"
        name                   = "quarkus-kerberos"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_logging_cloudwatch has changed
  ~ resource "github_repository" "quarkus_logging_cloudwatch" {
      ~ etag                   = "W/\"a756493f7a10665394ad38b16041dad0daa879a76b8969419ff2882d9a9540ed\"" -> "W/\"67595a6a2aa6921a3065628e64206c248853e02ad7b9ff63d498a386df9171df\""
        id                     = "quarkus-logging-cloudwatch"
        name                   = "quarkus-logging-cloudwatch"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_logging_json has changed
  ~ resource "github_repository" "quarkus_logging_json" {
      ~ etag                   = "W/\"a9732ddf6a5c77237bc7c9afe52b85ca328fa6e38689f6ea868b603291d26c1b\"" -> "W/\"bcae349fe07964ec6e1438d072e103947da2e0fcfc2115040e2bc4a86a722f9f\""
        id                     = "quarkus-logging-json"
        name                   = "quarkus-logging-json"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_logging_manager has changed
  ~ resource "github_repository" "quarkus_logging_manager" {
      ~ etag                   = "W/\"595b6b6cc590e7a1074a55dba6adfd6aac5131d2b3534cfbef34c20431ef8eb6\"" -> "W/\"bdac55929edbe134e7218e00b88d5307256c6b167d01605def7d696a1112f56c\""
        id                     = "quarkus-logging-manager"
        name                   = "quarkus-logging-manager"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_logging_sentry has changed
  ~ resource "github_repository" "quarkus_logging_sentry" {
      ~ etag                   = "W/\"b6acf5b665bc6a8b24656c0ff078bbe5730d8621da863747e89eceb4e9214252\"" -> "W/\"b1500a068b26b9ecdd700088f0675299a217851a09c058601a3dea07d6e4e5c6\""
        id                     = "quarkus-logging-sentry"
        name                   = "quarkus-logging-sentry"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_logging_splunk has changed
  ~ resource "github_repository" "quarkus_logging_splunk" {
      ~ etag                   = "W/\"b1e106f23077671bbc815637945fd3029d7043f65fc9ade7152317357a63845e\"" -> "W/\"ce8cb8bebd23e0812bebf773b5c24d4c2548f43efd0f41d934a22e4ed85daed3\""
        id                     = "quarkus-logging-splunk"
        name                   = "quarkus-logging-splunk"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_maven_resolver has changed
  ~ resource "github_repository" "quarkus_maven_resolver" {
      ~ etag                   = "W/\"b00bfe7c8dae86f6de73c97a9c4faa7664542fb839e1d25a32a0580e22e2c826\"" -> "W/\"302999dac8f01c110770cf8839aabdf0fe5e949a6bdf0a85037dde44524e6deb\""
        id                     = "quarkus-maven-resolver"
        name                   = "quarkus-maven-resolver"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_micrometer_registry has changed
  ~ resource "github_repository" "quarkus_micrometer_registry" {
      ~ etag                   = "W/\"8b85146f0631386dd769bef51ae76e6fafa5de0b0ce639a86e3dbe0db9c5c583\"" -> "W/\"13c28348ab8194923ea724d48351af479ea3fbad1146c4696eae4a4eeddcab1e\""
        id                     = "quarkus-micrometer-registry"
        name                   = "quarkus-micrometer-registry"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_minio has changed
  ~ resource "github_repository" "quarkus_minio" {
      ~ etag                   = "W/\"bfc43a2ebff673ad62e4a4c7b205454effbc8a1196f955f41d143ab56a57abb5\"" -> "W/\"d96297d29f2a3bca7ec5c159f6f5122b6b87f381ce727b66b7b0617618894204\""
        id                     = "quarkus-minio"
        name                   = "quarkus-minio"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_morphia has changed
  ~ resource "github_repository" "quarkus_morphia" {
      ~ etag                   = "W/\"a8d5b24fbb5ef67a82a5b9914c9daa7100aaa89936ae1fd2a8b607e955c6fa77\"" -> "W/\"80d94f706cac073e98fa79269c87407dddbe694c8ed6991c133e4b43c3680733\""
        id                     = "quarkus-morphia"
        name                   = "quarkus-morphia"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_mybatis has changed
  ~ resource "github_repository" "quarkus_mybatis" {
      ~ etag                   = "W/\"b0482a17d5604555900af5d11c2ac71478c4eb7e5c23410007a04d27a84b69b5\"" -> "W/\"2485be0a91c1f9ce5e9affacf0c21c9f7d9caea2d2985693325f2e8d830c1c4c\""
        id                     = "quarkus-mybatis"
        name                   = "quarkus-mybatis"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_neo4j has changed
  ~ resource "github_repository" "quarkus_neo4j" {
      ~ etag                   = "W/\"4fbe196ac420c5dc35fab22818b48d82e87f6d295a8c69d227e5fd04d1c29965\"" -> "W/\"4920acd3890bd696a31457ee507fd5af563eceb1b7de2bd0f0cf34e54a395ace\""
        id                     = "quarkus-neo4j"
        name                   = "quarkus-neo4j"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_opencv has changed
  ~ resource "github_repository" "quarkus_opencv" {
      ~ etag                   = "W/\"51c0c0a5e7f81d1cf0c19bd072c3877882e680ce56a1287d8ece28011936cfd8\"" -> "W/\"6c69828ee082749c3054aad7474e1a2fe69efd22090378c706ac822072f100f4\""
        id                     = "quarkus-opencv"
        name                   = "quarkus-opencv"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_operator_sdk has changed
  ~ resource "github_repository" "quarkus_operator_sdk" {
      ~ etag                   = "W/\"58ece1907a841bcc571f60c8aae00f7f38d6f1c5b04e44cef70be61ad940be28\"" -> "W/\"2af8926b017f0a2ee888b08be7006bae8eb48f2c5bf1418d9bb93d414959fb74\""
        id                     = "quarkus-operator-sdk"
        name                   = "quarkus-operator-sdk"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_prettytime has changed
  ~ resource "github_repository" "quarkus_prettytime" {
      ~ etag                   = "W/\"d444fbdd740cbb45bccd94effc6311a4f365d9340643624c55799cfce6069a54\"" -> "W/\"292a2ef8023f915b911fd234dcea22f01e1ea5a7f64a44382d1760b6b18d754b\""
        id                     = "quarkus-prettytime"
        name                   = "quarkus-prettytime"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_rabbitmq_client has changed
  ~ resource "github_repository" "quarkus_rabbitmq_client" {
      ~ etag                   = "W/\"12887d96770af9b342ba0a4d3e3cfdc09fa77eb51c49f1074348f33b6b778dbe\"" -> "W/\"df1b921d328493998231a09e118d14ac80c673e0c4c23e51b75e578feee2e9d9\""
        id                     = "quarkus-rabbitmq-client"
        name                   = "quarkus-rabbitmq-client"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_reactive_messaging_http has changed
  ~ resource "github_repository" "quarkus_reactive_messaging_http" {
      ~ etag                   = "W/\"4223a3c5c85f4ceb6812dd04ddb911d37d98c4912e4f6cf1b3c80333c52449d3\"" -> "W/\"2f46b3599032e433e3bcf03b9c86af0a669e2aa17d3b4a9df10969e67d4c0a20\""
        id                     = "quarkus-reactive-messaging-http"
        name                   = "quarkus-reactive-messaging-http"
        # (27 unchanged attributes hidden)
    }

  # github_repository.quarkus_tekton_client has changed
  ~ resource "github_repository" "quarkus_tekton_client" {
      ~ etag                   = "W/\"9f43d80687278096ac32418aae116c12191ec560afa08a4f0b5a3e0c0c36245d\"" -> "W/\"aeea9c7c71b63c9b72ebeae3c0713cb1628ef733ab84da474250a128e94e75f7\""
        id                     = "quarkus-tekton-client"
        name                   = "quarkus-tekton-client"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_tika has changed
  ~ resource "github_repository" "quarkus_tika" {
      ~ etag                   = "W/\"998e850075ccf1b5232ed8c3bd3515f43695880c8efadc822ec352a43dda8365\"" -> "W/\"e10af0c8f64577972f5df8ff38e8d3e98be1d342bc646083951a7bd399c1c44e\""
        id                     = "quarkus-tika"
        name                   = "quarkus-tika"
        # (26 unchanged attributes hidden)
    }

  # github_repository.quarkus_vault has changed
  ~ resource "github_repository" "quarkus_vault" {
      ~ etag                   = "W/\"fa3c1e828407605bac6051d8a94c3a99da2597f6b46ad9733401391c522bad03\"" -> "W/\"be207286f17023c169cc9052fbfba99c7f433bdb112baed5bf6681ff2acc8501\""
        id                     = "quarkus-vault"
        name                   = "quarkus-vault"
        # (26 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_amazon_alexa has changed
  ~ resource "github_team_repository" "quarkus_amazon_alexa" {
      ~ etag       = "W/\"92edf5fcf275008ff9bc5029803aa5e425ce794d7ea610fabb833a286c7c18df\"" -> "W/\"267f847f28a2b3ae26e3009bd3ba55cb52b1b84a8c51f09c14c4eab2a51c5e9f\""
        id         = "5438751:quarkus-amazon-alexa"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_amazon_services has changed
  ~ resource "github_team_repository" "quarkus_amazon_services" {
      ~ etag       = "W/\"a0c0619ddba8be1f20725afe44dfd53d5b2479807771a00daa4b804a56b80ba3\"" -> "W/\"82b70991c0cedefd8a1453a7f42072b0afb0b1a4234220e2e4a0284f7eb80b51\""
        id         = "5438747:quarkus-amazon-services"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_apicurio_registry_client has changed
  ~ resource "github_team_repository" "quarkus_apicurio_registry_client" {
      ~ etag       = "W/\"411c49fdf6afb83563f8c609bd579c3e736da4468c0771cfd90d8c5aa5a0942e\"" -> "W/\"e0c11bcb36cc973844cb5cae5e29475ae1a4b4ebf70bf400bd78791794409986\""
        id         = "4359832:quarkus-apicurio-registry-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_artemis has changed
  ~ resource "github_team_repository" "quarkus_artemis" {
      ~ etag       = "W/\"8b23cc90afc1b69a9ee362fc7adfdf8456f055779ad86fa7fa038d88184e88b4\"" -> "W/\"ec1a354079146c8559ea1088996caa044ce93bff827b29dfaba5b0f3bb39f1fe\""
        id         = "5438742:quarkus-artemis"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_config_extensions has changed
  ~ resource "github_team_repository" "quarkus_config_extensions" {
      ~ etag       = "W/\"2cc4d0c7619843f87a8561925975f0cc9b9300cdc5b3d28c8dd83cae886325ce\"" -> "W/\"4a5aa600ce34e05f6b121f15f791fdec52d21611c54ff1091dec761c5b6e7477\""
        id         = "4679791:quarkus-config-extensions"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_cucumber has changed
  ~ resource "github_team_repository" "quarkus_cucumber" {
      ~ etag       = "W/\"ef10c7561ce8f8478c4a5f36b1461215a12c7c004c4271b5b8e907a26302093f\"" -> "W/\"6c1c924973a32e99a96a43c7f986e74142b50d07154d78872af9dea9df26527b\""
        id         = "5020733:quarkus-cucumber"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_cxf has changed
  ~ resource "github_team_repository" "quarkus_cxf" {
      ~ etag       = "W/\"ccdd9dcdb480243d14ebf6c28828bc399d55660bbd5ee24b5a5e59713c1b5120\"" -> "W/\"9b3b7ac9f49e43104cb4b393ff4567990e1d8d94030a3ed33fdebfb0269fe4b8\""
        id         = "4221025:quarkus-cxf"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_datadog_opentracing has changed
  ~ resource "github_team_repository" "quarkus_datadog_opentracing" {
      ~ etag       = "W/\"89a568eda76cea7562555026f6937dbd3fa72ca0f7e0ea0e90c3ca87b0979dbf\"" -> "W/\"327ea205692afcb0bb78b010ad4f2909a1eeb56369d1b7c3942368a655324dc3\""
        id         = "4759562:quarkus-datadog-opentracing"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_doma has changed
  ~ resource "github_team_repository" "quarkus_doma" {
      ~ etag       = "W/\"20eeaf9740bb67bbb88a3868ad44bfd4b4be70ea87c08fb00d8291841c864df5\"" -> "W/\"e38fa878b54c58e4a8159993daa337d36a7106341d29b64d207af7d0e08f31a1\""
        id         = "4206574:quarkus-doma"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_elasticsearch_reactive has changed
  ~ resource "github_team_repository" "quarkus_elasticsearch_reactive" {
      ~ etag       = "W/\"35041aef7cc0666b5bab6374387b63c30fd4bf4762d938ebdc6580c27da36605\"" -> "W/\"14533efb557acaaceb67fdd8c197f77ec7d33d2da4cf5fcda6764bc4aa92af88\""
        id         = "4941463:quarkus-elasticsearch-reactive"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_freemarker has changed
  ~ resource "github_team_repository" "quarkus_freemarker" {
      ~ etag       = "W/\"ec283cb3911896f142de111ba3bec143349bc05d7388018ca16ed20248388df0\"" -> "W/\"f8ca67d849728972079a8bcd7e6cd778ce047dc15c0037e43d8780f5036e817f\""
        id         = "4139356:quarkus-freemarker"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_github_api has changed
  ~ resource "github_team_repository" "quarkus_github_api" {
      ~ etag       = "W/\"8e8dea6e355bbd4f4d5021e7e62329f7ae396c4131e1c30163816b0c1254880a\"" -> "W/\"894633c1923a94aac81715cd74b98d2aedca28ad6022bd1fb7d684bed4d566b4\""
        id         = "5327486:quarkus-github-api"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_github_app has changed
  ~ resource "github_team_repository" "quarkus_github_app" {
      ~ etag       = "W/\"c61fd6dd10e986e899c768d7523b69aae6adfb61ed51cf331c1f8361064e4226\"" -> "W/\"db5e2c57ee65fa5de14b5f4b41fb173eb681b568384d6294550cfed4afcd8514\""
        id         = "5327479:quarkus-github-app"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_google_cloud_services has changed
  ~ resource "github_team_repository" "quarkus_google_cloud_services" {
      ~ etag       = "W/\"3eca640c5bb43b95bfc183ff23d2fbf080b9f4931f2c602ed4528699a7e97cd5\"" -> "W/\"3d0271378ed09515dee8cfacd5c4c742b58a51e86319023ebf223e93cb7f4c6f\""
        id         = "4133757:quarkus-google-cloud-services"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_helm has changed
  ~ resource "github_team_repository" "quarkus_helm" {
      ~ etag       = "W/\"9d86bdc79c8fac91bcc0886dfeb1b321425e9ca26219b96ca1f1e1f96d3f13b5\"" -> "W/\"31aa30988814643b86bd579424c9f6a59f1190f6e411e2208bf2dfcaa3a7f8d9\""
        id         = "5693931:quarkus-helm"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_hibernate_search_extras has changed
  ~ resource "github_team_repository" "quarkus_hibernate_search_extras" {
      ~ etag       = "W/\"81037cb4ccff032a486cef894084ae9252943c2bc3f43859bac957efa285d58a\"" -> "W/\"94e0d4854414c87f40c8811627b79dffbb05bcb2b72842b716a45e712b73fb83\""
        id         = "5449102:quarkus-hibernate-search-extras"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_hibernate_types has changed
  ~ resource "github_team_repository" "quarkus_hibernate_types" {
      ~ etag       = "W/\"59954c0e355e207fd167ac4a6da7fb31976cdfcd8b8353bc505f1723fb6c7108\"" -> "W/\"ba20708f223c959664cf5d66a5457e26249f1ba88e7c8ba0500eeb961b032392\""
        id         = "4427586:quarkus-hibernate-types"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_hivemq_client has changed
  ~ resource "github_team_repository" "quarkus_hivemq_client" {
      ~ etag       = "W/\"b9f3d03fdd05e038263c10f8786b2ca192b04076dd380e62fb587d1d8514a0e3\"" -> "W/\"77964af153b030b5d83964b936bebf8cb5275f18195c33297d7dd25b95087bef\""
        id         = "4651319:quarkus-hivemq-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jackson_jq has changed
  ~ resource "github_team_repository" "quarkus_jackson_jq" {
      ~ etag       = "W/\"c07d4c49075ca0f1d2aaa6cafafd473a57ca7534774bc54433dba36a9aa7cf91\"" -> "W/\"332469f9bf123b8eb63f75f4f2442f27a433cbd8af533119d00c28b0b3492c05\""
        id         = "5182252:quarkus-jackson-jq"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jberet has changed
  ~ resource "github_team_repository" "quarkus_jberet" {
      ~ etag       = "W/\"d34282130a2675f60c29c72556d9a7c8967fe1b974f4fadb05b65d797269c023\"" -> "W/\"4f4bf477f1b3b69afde54f09cb0da23d79ea6e27fa0e1306e6f9269a1ce34f4d\""
        id         = "4130738:quarkus-jberet"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jgit has changed
  ~ resource "github_team_repository" "quarkus_jgit" {
      ~ etag       = "W/\"82cb826c14056f97d35ecb3d70ab9f971258a4cde96f8d787311fa0d201ce00f\"" -> "W/\"8d632e38d093fedb569fc52bac367c32d846a9b70b8657cac5c18ef6a11a8be8\""
        id         = "5418782:quarkus-jgit"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jgrapht has changed
  ~ resource "github_team_repository" "quarkus_jgrapht" {
      ~ etag       = "W/\"67b0a436c3e9f747c5e5817432d26243068e2f93bd3a381c6017d8159c7af486\"" -> "W/\"e0a912f962351c35070b3f7b342596433484a4e34eb872e13b9cd6f5a703a268\""
        id         = "4691584:quarkus-jgrapht"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jjwt_jackson has changed
  ~ resource "github_team_repository" "quarkus_jjwt_jackson" {
      ~ etag       = "W/\"5428ba5fdc3754b1e7ab02b00398d8469d197c9762245285e93635cd851f7d67\"" -> "W/\"aeeea85396ba0ffd64cb7b9956b1a1d9d00fd7a9446d582f0ca10e38d9932299\""
        id         = "4698127:quarkus-jjwt-jackson"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_jsch has changed
  ~ resource "github_team_repository" "quarkus_jsch" {
      ~ etag       = "W/\"3c58f5ed59291842e1cd5238db400bd4f4fae739f5d6e3605d98e9dd51a616e6\"" -> "W/\"fb9e60f7d734a1a49bd5e21835fc713c57a90369694fe4e58be8699161358a51\""
        id         = "5418783:quarkus-jsch"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_kerberos has changed
  ~ resource "github_team_repository" "quarkus_kerberos" {
      ~ etag       = "W/\"e1661841f3f8825e67c343963364d1eddc9f9e3785ad96f51977333ae8d7b770\"" -> "W/\"f129d6e6e058f772172b98e273a7cfd15a82845dbc55d4fda032a3cce0b2b259\""
        id         = "5330599:quarkus-kerberos"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_cloudwatch has changed
  ~ resource "github_team_repository" "quarkus_logging_cloudwatch" {
      ~ etag       = "W/\"dde413eee29ee62407f2c6c7cc656bcf27a211c35930a4f02c03e0934c86d980\"" -> "W/\"be16c004f5502a07b634a2e160ba96d958c711da326806b1e392410d6f62388d\""
        id         = "4766806:quarkus-logging-cloudwatch"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_json has changed
  ~ resource "github_team_repository" "quarkus_logging_json" {
      ~ etag       = "W/\"b2a38fd858ec58410045ed483af767ea4149c044988ffd52a182a688073894cf\"" -> "W/\"717d622192c0a7f0777e107c5de47cbd117486e222d5cf263419191b56340af6\""
        id         = "4136031:quarkus-logging-json"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_manager has changed
  ~ resource "github_team_repository" "quarkus_logging_manager" {
      ~ etag       = "W/\"196ee3ff03f45cefd052a50a88d0006913a1b711f1dd499a6d6893cbd1deef56\"" -> "W/\"8c4212e35b61ec37f5bd1a0ad9d2592c7bced4034d3ceee9d1caf0b72760230b\""
        id         = "4193789:quarkus-logging-manager"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_sentry has changed
  ~ resource "github_team_repository" "quarkus_logging_sentry" {
      ~ etag       = "W/\"5c8cba9437de825a938c5f045b6401ddf9971eaa453f47adc81e3964499461a5\"" -> "W/\"4f4345831660e8376e1a17bf625bdca536d0a3f2faea5ce8428654e4f71ef832\""
        id         = "5300000:quarkus-logging-sentry"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_logging_splunk has changed
  ~ resource "github_team_repository" "quarkus_logging_splunk" {
      ~ etag       = "W/\"facb9655e40f69f1ac51f793a52f53eaae02d00b7848264b03b518e756c42386\"" -> "W/\"3217b6ad6fd45e467554eb0f8deef2aa148bdc95db8996f1e3e293c2d7301a14\""
        id         = "4611522:quarkus-logging-splunk"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_maven_resolver has changed
  ~ resource "github_team_repository" "quarkus_maven_resolver" {
      ~ etag       = "W/\"2d11f52b237b2815e865915db80fddfd472f27a2369f95ac2f8f33dba9fdad39\"" -> "W/\"f7f2d695264b5103a9f4ffda2f613fbc3c17cf2eaf1a7840ae5c040ed0f56fb9\""
        id         = "5330694:quarkus-maven-resolver"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_micrometer_registry has changed
  ~ resource "github_team_repository" "quarkus_micrometer_registry" {
      ~ etag       = "W/\"e2cd7ba68772ae341fbcf40374fa752a16c25948a1cdbb2a60888ebf4d04498f\"" -> "W/\"221b435502b6aa842946f66d614fe604c2aacaa62b151c877dd4b91030e874be\""
        id         = "4331393:quarkus-micrometer-registry"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_minio has changed
  ~ resource "github_team_repository" "quarkus_minio" {
      ~ etag       = "W/\"13ed8fe24fb316bb2e8a897cdf68be9f1cb923db3597b81bb12569db1deb3808\"" -> "W/\"fd86338838f72842bbb3b3286d752c055858a3d5dbd5f44565279585e4d8c4d9\""
        id         = "4257600:quarkus-minio"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_morphia has changed
  ~ resource "github_team_repository" "quarkus_morphia" {
      ~ etag       = "W/\"bf75d80a5428fb48d810c35cad9f004b29553d542ba3786a4f98aed4457dd962\"" -> "W/\"945cde2f2860a5eecd0169d60d0cc72f7fccf4d9ab3806f5c2d6e1eb0ea7e2a5\""
        id         = "4994632:quarkus-morphia"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_mybatis has changed
  ~ resource "github_team_repository" "quarkus_mybatis" {
      ~ etag       = "W/\"2c9563edcc206d3c5b3d08a109110b64d1660d2f3de8a9a3c25edaed8e63b5a6\"" -> "W/\"cd67ce6031ba6c4ff1ff692466bf05968c2ff10382f69797353940d96009912e\""
        id         = "4163389:quarkus-mybatis"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_neo4j has changed
  ~ resource "github_team_repository" "quarkus_neo4j" {
      ~ etag       = "W/\"667ce8061d036ec0738198288fda95ff0d95afc5c3506a988fb944c364898878\"" -> "W/\"5817f02cf41eac29d2f8aa1a849d94d20b6968f372bb60242338c657e29c6ed6\""
        id         = "5438745:quarkus-neo4j"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_openapi_generator has changed
  ~ resource "github_team_repository" "quarkus_openapi_generator" {
      ~ etag       = "W/\"df9fc63ad4c56264f7dfe5745c98332785d91fca18518ac638e8d3b5628952c1\"" -> "W/\"5dc33a44e8e97f046bb7e0fbf0794e65cc1105c108675b51b549322dd5d2e7e9\""
        id         = "5649834:quarkus-openapi-generator"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_opencv has changed
  ~ resource "github_team_repository" "quarkus_opencv" {
      ~ etag       = "W/\"bee1f90af0ace3c51393889e0a8cfc00981caf59b738718a083a7b7ef754bdbb\"" -> "W/\"f75e45f8af4d47e3d35aea814790fc881daf445e55912fc0101d0a217b4cb406\""
        id         = "5330519:quarkus-opencv"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_operator_sdk has changed
  ~ resource "github_team_repository" "quarkus_operator_sdk" {
      ~ etag       = "W/\"b707728476824f36f960affae96be0961776de0c97168e36a617046160ea5e44\"" -> "W/\"000d9e0f07123bf944bb83ce6dc2bccb8aed649c167a64e879ad618f95c333bc\""
        id         = "4585468:quarkus-operator-sdk"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_prettytime has changed
  ~ resource "github_team_repository" "quarkus_prettytime" {
      ~ etag       = "W/\"09a9723a71d0b4928bb9ea729dd107caa00f04afe54242f0a027878a759e4fcd\"" -> "W/\"e91a2a2222bea903a09090918f832e4a4175328e3c3a9ae698babb653018c1bd\""
        id         = "4612233:quarkus-prettytime"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_rabbitmq_client has changed
  ~ resource "github_team_repository" "quarkus_rabbitmq_client" {
      ~ etag       = "W/\"58e77f71c3e8b44304853e07e11ae987a11a34233ffc7161b6b6fd1bb4009d56\"" -> "W/\"3a9e625d794164ee91cc4947cd2216b896c7a6fb6f39175ce8e1240d2c767c71\""
        id         = "4454281:quarkus-rabbitmq-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_reactive_messaging_http has changed
  ~ resource "github_team_repository" "quarkus_reactive_messaging_http" {
      ~ etag       = "W/\"613f958b95acb9ae8fd52e542ba9ccb4c095b699ffd44882e30dca6871f22fae\"" -> "W/\"9428a4ee9237b683f2f7aa3e14164249d4f274e676474679c57ac9a5997aaa00\""
        id         = "5290863:quarkus-reactive-messaging-http"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_tekton_client has changed
  ~ resource "github_team_repository" "quarkus_tekton_client" {
      ~ etag       = "W/\"e407b16a67136c2a9c47a5d2d4937467679fbd4852d41d43e67f20fb236c1ee8\"" -> "W/\"bdc7ba1bb62d8f1a5d8af9e1cc734d03feb8bf011dfaad970e534c90934635db\""
        id         = "4429729:quarkus-tekton-client"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_tika has changed
  ~ resource "github_team_repository" "quarkus_tika" {
      ~ etag       = "W/\"971b7e36083b7d8fca4925f03552f130dda255835188a17205b4e4b1eb6b083b\"" -> "W/\"a59482afab96ac18b7c410473b53d13e1a0d57c412b7dca7d751010e1d49deb3\""
        id         = "5317008:quarkus-tika"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.quarkus_vault has changed
  ~ resource "github_team_repository" "quarkus_vault" {
      ~ etag       = "W/\"16e6e685d701011d5d52b15bfc0f1c764536f2ba5bb49b7a27cd969b00c58af7\"" -> "W/\"a84966cab4cbfef92381647f3f7d3ee2b43c705a80acadb41be96fb4b9dcd57d\""
        id         = "5438750:quarkus-vault"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.quarkus_file_vault will be created
  + resource "github_repository" "quarkus_file_vault" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Credentials Provider which extracts secrets from Java KeyStore"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "quarkus-file-vault"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "quarkus-extension",
        ]
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # github_team.quarkus_file_vault will be created
  + resource "github_team" "quarkus_file_vault" {
      + create_default_maintainer = false
      + description               = "Quarkiverse file-vault team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-file-vault"
      + node_id                   = (known after apply)
      + parent_team_id            = 5344029
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_file_vault["cescoffier"] will be created
  + resource "github_team_membership" "quarkus_file_vault" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "cescoffier"
    }

  # github_team_membership.quarkus_file_vault["sberyozkin"] will be created
  + resource "github_team_membership" "quarkus_file_vault" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "sberyozkin"
    }

  # github_team_membership.quarkus_file_vault["stuartwdouglas"] will be created
  + resource "github_team_membership" "quarkus_file_vault" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "stuartwdouglas"
    }

  # github_team_repository.quarkus_file_vault will be created
  + resource "github_team_repository" "quarkus_file_vault" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-file-vault"
      + team_id    = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @gastaldi, Action: `pull_request`*